frankleonrose/framework-cmsis-atmelsam/variants/atmelsam/sam4l8/include/component/catb.h
/**
 * \file
 *
 * \brief Component description for CATB
 *
 * Copyright (c) 2016 Atmel Corporation,
 *                    a wholly owned subsidiary of Microchip Technology Inc.
 *
 * \asf_license_start
 *
 * \page License
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the Licence at
 *
 *     http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 * \asf_license_stop
 *
 */

#ifndef _SAM4L_CATB_COMPONENT_
#define _SAM4L_CATB_COMPONENT_

/* ========================================================================== */
/**  SOFTWARE API DEFINITION FOR CATB */
/* ========================================================================== */
/** \addtogroup SAM4L_CATB Capacitive Touch Module B */
/*@{*/

#define CATB_I7567
#define REV_CATB                    0x100

/* -------- CATB_CR : (CATB Offset: 0x00) (R/W 32) Control Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t EN:1;             /*!< bit:      0  Module Enable                      */
    uint32_t RUN:1;            /*!< bit:      1  Start Operation                    */
    uint32_t IIDLE:1;          /*!< bit:      2  Initialize Idle Value              */
    uint32_t ETRIG:1;          /*!< bit:      3  Event Triggered Operation          */
    uint32_t INTRES:1;         /*!< bit:      4  Internal Resistors                 */
    uint32_t CKSEL:1;          /*!< bit:      5  Clock Select                       */
    uint32_t DIFF:1;           /*!< bit:      6  Differential Mode                  */
    uint32_t DMAEN:1;          /*!< bit:      7  DMA Enable                         */
    uint32_t ESAMPLES:7;       /*!< bit:  8..14  Number of Event Samples            */
    uint32_t :1;               /*!< bit:     15  Reserved                           */
    uint32_t CHARGET:4;        /*!< bit: 16..19  Charge Time                        */
    uint32_t :11;              /*!< bit: 20..30  Reserved                           */
    uint32_t SWRST:1;          /*!< bit:     31  Software Reset                     */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} CATB_CR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define CATB_CR_OFFSET              0x00         /**< \brief (CATB_CR offset) Control Register */
#define CATB_CR_RESETVALUE          _U(0x00000000); /**< \brief (CATB_CR reset_value) Control Register */

#define CATB_CR_EN_Pos              0            /**< \brief (CATB_CR) Module Enable */
#define CATB_CR_EN                  (_U(0x1) << CATB_CR_EN_Pos)
#define CATB_CR_RUN_Pos             1            /**< \brief (CATB_CR) Start Operation */
#define CATB_CR_RUN                 (_U(0x1) << CATB_CR_RUN_Pos)
#define CATB_CR_IIDLE_Pos           2            /**< \brief (CATB_CR) Initialize Idle Value */
#define CATB_CR_IIDLE               (_U(0x1) << CATB_CR_IIDLE_Pos)
#define CATB_CR_ETRIG_Pos           3            /**< \brief (CATB_CR) Event Triggered Operation */
#define CATB_CR_ETRIG               (_U(0x1) << CATB_CR_ETRIG_Pos)
#define CATB_CR_INTRES_Pos          4            /**< \brief (CATB_CR) Internal Resistors */
#define CATB_CR_INTRES              (_U(0x1) << CATB_CR_INTRES_Pos)
#define CATB_CR_CKSEL_Pos           5            /**< \brief (CATB_CR) Clock Select */
#define CATB_CR_CKSEL               (_U(0x1) << CATB_CR_CKSEL_Pos)
#define CATB_CR_DIFF_Pos            6            /**< \brief (CATB_CR) Differential Mode */
#define CATB_CR_DIFF                (_U(0x1) << CATB_CR_DIFF_Pos)
#define CATB_CR_DMAEN_Pos           7            /**< \brief (CATB_CR) DMA Enable */
#define CATB_CR_DMAEN               (_U(0x1) << CATB_CR_DMAEN_Pos)
#define CATB_CR_ESAMPLES_Pos        8            /**< \brief (CATB_CR) Number of Event Samples */
#define CATB_CR_ESAMPLES_Msk        (_U(0x7F) << CATB_CR_ESAMPLES_Pos)
#define CATB_CR_ESAMPLES(value)     (CATB_CR_ESAMPLES_Msk & ((value) << CATB_CR_ESAMPLES_Pos))
#define CATB_CR_CHARGET_Pos         16           /**< \brief (CATB_CR) Charge Time */
#define CATB_CR_CHARGET_Msk         (_U(0xF) << CATB_CR_CHARGET_Pos)
#define CATB_CR_CHARGET(value)      (CATB_CR_CHARGET_Msk & ((value) << CATB_CR_CHARGET_Pos))
#define CATB_CR_SWRST_Pos           31           /**< \brief (CATB_CR) Software Reset */
#define CATB_CR_SWRST               (_U(0x1) << CATB_CR_SWRST_Pos)
#define CATB_CR_MASK                _U(0x800F7FFF) /**< \brief (CATB_CR) MASK Register */

/* -------- CATB_CNTCR : (CATB Offset: 0x04) (R/W 32) Counter Control Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t TOP:24;           /*!< bit:  0..23  Counter Top Value                  */
    uint32_t SPREAD:4;         /*!< bit: 24..27  Spread Spectrum                    */
    uint32_t REPEAT:3;         /*!< bit: 28..30  Repeat Measurements                */
    uint32_t :1;               /*!< bit:     31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} CATB_CNTCR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define CATB_CNTCR_OFFSET           0x04         /**< \brief (CATB_CNTCR offset) Counter Control Register */
#define CATB_CNTCR_RESETVALUE       _U(0x00000000); /**< \brief (CATB_CNTCR reset_value) Counter Control Register */

