frankleonrose/framework-cmsis-atmelsam/variants/atmelsam/sam4l8/include/component/catb.h
#define CATB_CNTCR_TOP_Pos          0            /**< \brief (CATB_CNTCR) Counter Top Value */
#define CATB_CNTCR_TOP_Msk          (_U(0xFFFFFF) << CATB_CNTCR_TOP_Pos)
#define CATB_CNTCR_TOP(value)       (CATB_CNTCR_TOP_Msk & ((value) << CATB_CNTCR_TOP_Pos))
#define CATB_CNTCR_SPREAD_Pos       24           /**< \brief (CATB_CNTCR) Spread Spectrum */
#define CATB_CNTCR_SPREAD_Msk       (_U(0xF) << CATB_CNTCR_SPREAD_Pos)
#define CATB_CNTCR_SPREAD(value)    (CATB_CNTCR_SPREAD_Msk & ((value) << CATB_CNTCR_SPREAD_Pos))
#define CATB_CNTCR_REPEAT_Pos       28           /**< \brief (CATB_CNTCR) Repeat Measurements */
#define CATB_CNTCR_REPEAT_Msk       (_U(0x7) << CATB_CNTCR_REPEAT_Pos)
#define CATB_CNTCR_REPEAT(value)    (CATB_CNTCR_REPEAT_Msk & ((value) << CATB_CNTCR_REPEAT_Pos))
#define CATB_CNTCR_MASK             _U(0x7FFFFFFF) /**< \brief (CATB_CNTCR) MASK Register */

/* -------- CATB_IDLE : (CATB Offset: 0x08) (R/W 32) Sensor Idle Level -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t FIDLE:12;         /*!< bit:  0..11  Fractional Sensor Idle             */
    uint32_t RIDLE:16;         /*!< bit: 12..27  Integer Sensor Idle                */
    uint32_t :4;               /*!< bit: 28..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} CATB_IDLE_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define CATB_IDLE_OFFSET            0x08         /**< \brief (CATB_IDLE offset) Sensor Idle Level */
#define CATB_IDLE_RESETVALUE        _U(0x00000000); /**< \brief (CATB_IDLE reset_value) Sensor Idle Level */

#define CATB_IDLE_FIDLE_Pos         0            /**< \brief (CATB_IDLE) Fractional Sensor Idle */
#define CATB_IDLE_FIDLE_Msk         (_U(0xFFF) << CATB_IDLE_FIDLE_Pos)
#define CATB_IDLE_FIDLE(value)      (CATB_IDLE_FIDLE_Msk & ((value) << CATB_IDLE_FIDLE_Pos))
#define CATB_IDLE_RIDLE_Pos         12           /**< \brief (CATB_IDLE) Integer Sensor Idle */
#define CATB_IDLE_RIDLE_Msk         (_U(0xFFFF) << CATB_IDLE_RIDLE_Pos)
#define CATB_IDLE_RIDLE(value)      (CATB_IDLE_RIDLE_Msk & ((value) << CATB_IDLE_RIDLE_Pos))
#define CATB_IDLE_MASK              _U(0x0FFFFFFF) /**< \brief (CATB_IDLE) MASK Register */

/* -------- CATB_LEVEL : (CATB Offset: 0x0C) (R/  32) Sensor Relative Level -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t FLEVEL:12;        /*!< bit:  0..11  Fractional Sensor Level            */
    uint32_t RLEVEL:8;         /*!< bit: 12..19  Integer Sensor Level               */
    uint32_t :12;              /*!< bit: 20..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} CATB_LEVEL_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define CATB_LEVEL_OFFSET           0x0C         /**< \brief (CATB_LEVEL offset) Sensor Relative Level */
#define CATB_LEVEL_RESETVALUE       _U(0x00000000); /**< \brief (CATB_LEVEL reset_value) Sensor Relative Level */

#define CATB_LEVEL_FLEVEL_Pos       0            /**< \brief (CATB_LEVEL) Fractional Sensor Level */
#define CATB_LEVEL_FLEVEL_Msk       (_U(0xFFF) << CATB_LEVEL_FLEVEL_Pos)
#define CATB_LEVEL_FLEVEL(value)    (CATB_LEVEL_FLEVEL_Msk & ((value) << CATB_LEVEL_FLEVEL_Pos))
#define CATB_LEVEL_RLEVEL_Pos       12           /**< \brief (CATB_LEVEL) Integer Sensor Level */
#define CATB_LEVEL_RLEVEL_Msk       (_U(0xFF) << CATB_LEVEL_RLEVEL_Pos)
#define CATB_LEVEL_RLEVEL(value)    (CATB_LEVEL_RLEVEL_Msk & ((value) << CATB_LEVEL_RLEVEL_Pos))
#define CATB_LEVEL_MASK             _U(0x000FFFFF) /**< \brief (CATB_LEVEL) MASK Register */

/* -------- CATB_RAW : (CATB Offset: 0x10) (R/  32) Sensor Raw Value -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t :16;              /*!< bit:  0..15  Reserved                           */
    uint32_t RAWA:8;           /*!< bit: 16..23  Current Sensor Raw Value           */
    uint32_t RAWB:8;           /*!< bit: 24..31  Last Sensor Raw Value              */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} CATB_RAW_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define CATB_RAW_OFFSET             0x10         /**< \brief (CATB_RAW offset) Sensor Raw Value */
#define CATB_RAW_RESETVALUE         _U(0x00000000); /**< \brief (CATB_RAW reset_value) Sensor Raw Value */

#define CATB_RAW_RAWA_Pos           16           /**< \brief (CATB_RAW) Current Sensor Raw Value */
#define CATB_RAW_RAWA_Msk           (_U(0xFF) << CATB_RAW_RAWA_Pos)
#define CATB_RAW_RAWA(value)        (CATB_RAW_RAWA_Msk & ((value) << CATB_RAW_RAWA_Pos))
#define CATB_RAW_RAWB_Pos           24           /**< \brief (CATB_RAW) Last Sensor Raw Value */
#define CATB_RAW_RAWB_Msk           (_U(0xFF) << CATB_RAW_RAWB_Pos)
#define CATB_RAW_RAWB(value)        (CATB_RAW_RAWB_Msk & ((value) << CATB_RAW_RAWB_Pos))
#define CATB_RAW_MASK               _U(0xFFFF0000) /**< \brief (CATB_RAW) MASK Register */

/* -------- CATB_TIMING : (CATB Offset: 0x14) (R/W 32) Filter Timing Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t TLEVEL:12;        /*!< bit:  0..11  Relative Level Smoothing           */
    uint32_t :4;               /*!< bit: 12..15  Reserved                           */
    uint32_t TIDLE:12;         /*!< bit: 16..27  Idle Smoothening                   */
    uint32_t :4;               /*!< bit: 28..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} CATB_TIMING_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define CATB_TIMING_OFFSET          0x14         /**< \brief (CATB_TIMING offset) Filter Timing Register */
#define CATB_TIMING_RESETVALUE      _U(0x00000000); /**< \brief (CATB_TIMING reset_value) Filter Timing Register */

#define CATB_TIMING_TLEVEL_Pos      0            /**< \brief (CATB_TIMING) Relative Level Smoothing */
#define CATB_TIMING_TLEVEL_Msk      (_U(0xFFF) << CATB_TIMING_TLEVEL_Pos)
#define CATB_TIMING_TLEVEL(value)   (CATB_TIMING_TLEVEL_Msk & ((value) << CATB_TIMING_TLEVEL_Pos))
#define CATB_TIMING_TIDLE_Pos       16           /**< \brief (CATB_TIMING) Idle Smoothening */
#define CATB_TIMING_TIDLE_Msk       (_U(0xFFF) << CATB_TIMING_TIDLE_Pos)
#define CATB_TIMING_TIDLE(value)    (CATB_TIMING_TIDLE_Msk & ((value) << CATB_TIMING_TIDLE_Pos))
#define CATB_TIMING_MASK            _U(0x0FFF0FFF) /**< \brief (CATB_TIMING) MASK Register */

/* -------- CATB_THRESH : (CATB Offset: 0x18) (R/W 32) Threshold Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t FTHRESH:12;       /*!< bit:  0..11  Fractional part of Threshold Value */
    uint32_t RTHRESH:8;        /*!< bit: 12..19  Rational part of Threshold Value   */
    uint32_t :3;               /*!< bit: 20..22  Reserved                           */
    uint32_t DIR:1;            /*!< bit:     23  Threshold Direction                */
    uint32_t LENGTH:5;         /*!< bit: 24..28  Threshold Length                   */
    uint32_t :3;               /*!< bit: 29..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} CATB_THRESH_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

