frankleonrose/framework-cmsis-atmelsam/variants/atmelsam/sam4l8/include/component/catb.h
#define CATB_THRESH_OFFSET          0x18         /**< \brief (CATB_THRESH offset) Threshold Register */
#define CATB_THRESH_RESETVALUE      _U(0x00000000); /**< \brief (CATB_THRESH reset_value) Threshold Register */

#define CATB_THRESH_FTHRESH_Pos     0            /**< \brief (CATB_THRESH) Fractional part of Threshold Value */
#define CATB_THRESH_FTHRESH_Msk     (_U(0xFFF) << CATB_THRESH_FTHRESH_Pos)
#define CATB_THRESH_FTHRESH(value)  (CATB_THRESH_FTHRESH_Msk & ((value) << CATB_THRESH_FTHRESH_Pos))
#define CATB_THRESH_RTHRESH_Pos     12           /**< \brief (CATB_THRESH) Rational part of Threshold Value */
#define CATB_THRESH_RTHRESH_Msk     (_U(0xFF) << CATB_THRESH_RTHRESH_Pos)
#define CATB_THRESH_RTHRESH(value)  (CATB_THRESH_RTHRESH_Msk & ((value) << CATB_THRESH_RTHRESH_Pos))
#define CATB_THRESH_DIR_Pos         23           /**< \brief (CATB_THRESH) Threshold Direction */
#define CATB_THRESH_DIR             (_U(0x1) << CATB_THRESH_DIR_Pos)
#define CATB_THRESH_LENGTH_Pos      24           /**< \brief (CATB_THRESH) Threshold Length */
#define CATB_THRESH_LENGTH_Msk      (_U(0x1F) << CATB_THRESH_LENGTH_Pos)
#define CATB_THRESH_LENGTH(value)   (CATB_THRESH_LENGTH_Msk & ((value) << CATB_THRESH_LENGTH_Pos))
#define CATB_THRESH_MASK            _U(0x1F8FFFFF) /**< \brief (CATB_THRESH) MASK Register */

/* -------- CATB_PINSEL : (CATB Offset: 0x1C) (R/W 32) Pin Selection Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t PINSEL:8;         /*!< bit:  0.. 7  Pin Select                         */
    uint32_t :24;              /*!< bit:  8..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} CATB_PINSEL_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define CATB_PINSEL_OFFSET          0x1C         /**< \brief (CATB_PINSEL offset) Pin Selection Register */
#define CATB_PINSEL_RESETVALUE      _U(0x00000000); /**< \brief (CATB_PINSEL reset_value) Pin Selection Register */

#define CATB_PINSEL_PINSEL_Pos      0            /**< \brief (CATB_PINSEL) Pin Select */
#define CATB_PINSEL_PINSEL_Msk      (_U(0xFF) << CATB_PINSEL_PINSEL_Pos)
#define CATB_PINSEL_PINSEL(value)   (CATB_PINSEL_PINSEL_Msk & ((value) << CATB_PINSEL_PINSEL_Pos))
#define CATB_PINSEL_MASK            _U(0x000000FF) /**< \brief (CATB_PINSEL) MASK Register */

/* -------- CATB_DMA : (CATB Offset: 0x20) (R/W 32) Direct Memory Access Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t DMA:32;           /*!< bit:  0..31  Direct Memory Access               */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} CATB_DMA_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define CATB_DMA_OFFSET             0x20         /**< \brief (CATB_DMA offset) Direct Memory Access Register */
#define CATB_DMA_RESETVALUE         _U(0x00000000); /**< \brief (CATB_DMA reset_value) Direct Memory Access Register */

#define CATB_DMA_DMA_Pos            0            /**< \brief (CATB_DMA) Direct Memory Access */
#define CATB_DMA_DMA_Msk            (_U(0xFFFFFFFF) << CATB_DMA_DMA_Pos)
#define CATB_DMA_DMA(value)         (CATB_DMA_DMA_Msk & ((value) << CATB_DMA_DMA_Pos))
#define CATB_DMA_MASK               _U(0xFFFFFFFF) /**< \brief (CATB_DMA) MASK Register */

/* -------- CATB_ISR : (CATB Offset: 0x24) (R/  32) Interrupt Status Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t SAMPLE:1;         /*!< bit:      0  Sample Ready Interrupt Status      */
    uint32_t INTCH:1;          /*!< bit:      1  In-touch Interrupt Status          */
    uint32_t OUTTCH:1;         /*!< bit:      2  Out-of-Touch Interrupt Status      */
    uint32_t :29;              /*!< bit:  3..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} CATB_ISR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define CATB_ISR_OFFSET             0x24         /**< \brief (CATB_ISR offset) Interrupt Status Register */
#define CATB_ISR_RESETVALUE         _U(0x00000000); /**< \brief (CATB_ISR reset_value) Interrupt Status Register */

#define CATB_ISR_SAMPLE_Pos         0            /**< \brief (CATB_ISR) Sample Ready Interrupt Status */
#define CATB_ISR_SAMPLE             (_U(0x1) << CATB_ISR_SAMPLE_Pos)
#define CATB_ISR_INTCH_Pos          1            /**< \brief (CATB_ISR) In-touch Interrupt Status */
#define CATB_ISR_INTCH              (_U(0x1) << CATB_ISR_INTCH_Pos)
#define CATB_ISR_OUTTCH_Pos         2            /**< \brief (CATB_ISR) Out-of-Touch Interrupt Status */
#define CATB_ISR_OUTTCH             (_U(0x1) << CATB_ISR_OUTTCH_Pos)
#define CATB_ISR_MASK               _U(0x00000007) /**< \brief (CATB_ISR) MASK Register */

/* -------- CATB_IER : (CATB Offset: 0x28) ( /W 32) Interrupt Enable Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t SAMPLE:1;         /*!< bit:      0  Sample Ready Interrupt Enable      */
    uint32_t INTCH:1;          /*!< bit:      1  In-touch Interrupt Enable          */
    uint32_t OUTTCH:1;         /*!< bit:      2  Out-of-Touch Interrupt Enable      */
    uint32_t :29;              /*!< bit:  3..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} CATB_IER_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define CATB_IER_OFFSET             0x28         /**< \brief (CATB_IER offset) Interrupt Enable Register */
#define CATB_IER_RESETVALUE         _U(0x00000000); /**< \brief (CATB_IER reset_value) Interrupt Enable Register */

#define CATB_IER_SAMPLE_Pos         0            /**< \brief (CATB_IER) Sample Ready Interrupt Enable */
#define CATB_IER_SAMPLE             (_U(0x1) << CATB_IER_SAMPLE_Pos)
#define CATB_IER_INTCH_Pos          1            /**< \brief (CATB_IER) In-touch Interrupt Enable */
#define CATB_IER_INTCH              (_U(0x1) << CATB_IER_INTCH_Pos)
#define CATB_IER_OUTTCH_Pos         2            /**< \brief (CATB_IER) Out-of-Touch Interrupt Enable */
#define CATB_IER_OUTTCH             (_U(0x1) << CATB_IER_OUTTCH_Pos)
#define CATB_IER_MASK               _U(0x00000007) /**< \brief (CATB_IER) MASK Register */

/* -------- CATB_IDR : (CATB Offset: 0x2C) ( /W 32) Interrupt Disable Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t SAMPLE:1;         /*!< bit:      0  Sample Ready Interrupt Disable     */
    uint32_t INTCH:1;          /*!< bit:      1  In-touch Interrupt Disable         */
    uint32_t OUTTCH:1;         /*!< bit:      2  Out-of-Touch Interrupt Disable     */
    uint32_t :29;              /*!< bit:  3..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} CATB_IDR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define CATB_IDR_OFFSET             0x2C         /**< \brief (CATB_IDR offset) Interrupt Disable Register */
#define CATB_IDR_RESETVALUE         _U(0x00000000); /**< \brief (CATB_IDR reset_value) Interrupt Disable Register */

#define CATB_IDR_SAMPLE_Pos         0            /**< \brief (CATB_IDR) Sample Ready Interrupt Disable */
#define CATB_IDR_SAMPLE             (_U(0x1) << CATB_IDR_SAMPLE_Pos)
#define CATB_IDR_INTCH_Pos          1            /**< \brief (CATB_IDR) In-touch Interrupt Disable */
#define CATB_IDR_INTCH              (_U(0x1) << CATB_IDR_INTCH_Pos)
#define CATB_IDR_OUTTCH_Pos         2            /**< \brief (CATB_IDR) Out-of-Touch Interrupt Disable */
#define CATB_IDR_OUTTCH             (_U(0x1) << CATB_IDR_OUTTCH_Pos)
#define CATB_IDR_MASK               _U(0x00000007) /**< \brief (CATB_IDR) MASK Register */

/* -------- CATB_IMR : (CATB Offset: 0x30) (R/  32) Interrupt Mask Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t SAMPLE:1;         /*!< bit:      0  Sample Ready Interrupt Mask        */
    uint32_t INTCH:1;          /*!< bit:      1  In-touch Interrupt Mask            */
    uint32_t OUTTCH:1;         /*!< bit:      2  Out-of-Touch Interrupt Mask        */
    uint32_t :29;              /*!< bit:  3..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} CATB_IMR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

