frankleonrose/framework-cmsis-atmelsam/variants/atmelsam/sam4l8/include/component/catb.h
#define CATB_IMR_OFFSET             0x30         /**< \brief (CATB_IMR offset) Interrupt Mask Register */
#define CATB_IMR_RESETVALUE         _U(0x00000000); /**< \brief (CATB_IMR reset_value) Interrupt Mask Register */

#define CATB_IMR_SAMPLE_Pos         0            /**< \brief (CATB_IMR) Sample Ready Interrupt Mask */
#define CATB_IMR_SAMPLE             (_U(0x1) << CATB_IMR_SAMPLE_Pos)
#define CATB_IMR_INTCH_Pos          1            /**< \brief (CATB_IMR) In-touch Interrupt Mask */
#define CATB_IMR_INTCH              (_U(0x1) << CATB_IMR_INTCH_Pos)
#define CATB_IMR_OUTTCH_Pos         2            /**< \brief (CATB_IMR) Out-of-Touch Interrupt Mask */
#define CATB_IMR_OUTTCH             (_U(0x1) << CATB_IMR_OUTTCH_Pos)
#define CATB_IMR_MASK               _U(0x00000007) /**< \brief (CATB_IMR) MASK Register */

/* -------- CATB_SCR : (CATB Offset: 0x34) ( /W 32) Status Clear Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t SAMPLE:1;         /*!< bit:      0  Sample Ready                       */
    uint32_t INTCH:1;          /*!< bit:      1  In-touch                           */
    uint32_t OUTTCH:1;         /*!< bit:      2  Out-of-Touch                       */
    uint32_t :29;              /*!< bit:  3..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} CATB_SCR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define CATB_SCR_OFFSET             0x34         /**< \brief (CATB_SCR offset) Status Clear Register */
#define CATB_SCR_RESETVALUE         _U(0x00000000); /**< \brief (CATB_SCR reset_value) Status Clear Register */

#define CATB_SCR_SAMPLE_Pos         0            /**< \brief (CATB_SCR) Sample Ready */
#define CATB_SCR_SAMPLE             (_U(0x1) << CATB_SCR_SAMPLE_Pos)
#define CATB_SCR_INTCH_Pos          1            /**< \brief (CATB_SCR) In-touch */
#define CATB_SCR_INTCH              (_U(0x1) << CATB_SCR_INTCH_Pos)
#define CATB_SCR_OUTTCH_Pos         2            /**< \brief (CATB_SCR) Out-of-Touch */
#define CATB_SCR_OUTTCH             (_U(0x1) << CATB_SCR_OUTTCH_Pos)
#define CATB_SCR_MASK               _U(0x00000007) /**< \brief (CATB_SCR) MASK Register */

/* -------- CATB_INTCH : (CATB Offset: 0x40) (R/  32) INTCH In-Touch Status Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t INTCH:32;         /*!< bit:  0..31  In-Touch                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} CATB_INTCH_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define CATB_INTCH_OFFSET           0x40         /**< \brief (CATB_INTCH offset) In-Touch Status Register */
#define CATB_INTCH_RESETVALUE       _U(0x00000000); /**< \brief (CATB_INTCH reset_value) In-Touch Status Register */

#define CATB_INTCH_INTCH_Pos        0            /**< \brief (CATB_INTCH) In-Touch */
#define CATB_INTCH_INTCH_Msk        (_U(0xFFFFFFFF) << CATB_INTCH_INTCH_Pos)
#define CATB_INTCH_INTCH(value)     (CATB_INTCH_INTCH_Msk & ((value) << CATB_INTCH_INTCH_Pos))
#define CATB_INTCH_MASK             _U(0xFFFFFFFF) /**< \brief (CATB_INTCH) MASK Register */

/* -------- CATB_INTCHCLR : (CATB Offset: 0x50) ( /W 32) INTCHCLR In-Touch Status Clear Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t INTCHCLR:32;      /*!< bit:  0..31  In-Touch Clear                     */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} CATB_INTCHCLR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define CATB_INTCHCLR_OFFSET        0x50         /**< \brief (CATB_INTCHCLR offset) In-Touch Status Clear Register */
#define CATB_INTCHCLR_RESETVALUE    _U(0x00000000); /**< \brief (CATB_INTCHCLR reset_value) In-Touch Status Clear Register */

#define CATB_INTCHCLR_INTCHCLR_Pos  0            /**< \brief (CATB_INTCHCLR) In-Touch Clear */
#define CATB_INTCHCLR_INTCHCLR_Msk  (_U(0xFFFFFFFF) << CATB_INTCHCLR_INTCHCLR_Pos)
#define CATB_INTCHCLR_INTCHCLR(value) (CATB_INTCHCLR_INTCHCLR_Msk & ((value) << CATB_INTCHCLR_INTCHCLR_Pos))
#define CATB_INTCHCLR_MASK          _U(0xFFFFFFFF) /**< \brief (CATB_INTCHCLR) MASK Register */

/* -------- CATB_OUTTCH : (CATB Offset: 0x60) (R/  32) OUTTCH Out-of-Touch Status Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t OUTTCH:32;        /*!< bit:  0..31  Out-of-Touch                       */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} CATB_OUTTCH_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define CATB_OUTTCH_OFFSET          0x60         /**< \brief (CATB_OUTTCH offset) Out-of-Touch Status Register */
#define CATB_OUTTCH_RESETVALUE      _U(0x00000000); /**< \brief (CATB_OUTTCH reset_value) Out-of-Touch Status Register */

#define CATB_OUTTCH_OUTTCH_Pos      0            /**< \brief (CATB_OUTTCH) Out-of-Touch */
#define CATB_OUTTCH_OUTTCH_Msk      (_U(0xFFFFFFFF) << CATB_OUTTCH_OUTTCH_Pos)
#define CATB_OUTTCH_OUTTCH(value)   (CATB_OUTTCH_OUTTCH_Msk & ((value) << CATB_OUTTCH_OUTTCH_Pos))
#define CATB_OUTTCH_MASK            _U(0xFFFFFFFF) /**< \brief (CATB_OUTTCH) MASK Register */

/* -------- CATB_OUTTCHCLR : (CATB Offset: 0x70) ( /W 32) OUTTCHCLR Out-of-Touch Status Clear Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t OUTTCHCLR:32;     /*!< bit:  0..31  Out of Touch                       */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} CATB_OUTTCHCLR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define CATB_OUTTCHCLR_OFFSET       0x70         /**< \brief (CATB_OUTTCHCLR offset) Out-of-Touch Status Clear Register */
#define CATB_OUTTCHCLR_RESETVALUE   _U(0x00000000); /**< \brief (CATB_OUTTCHCLR reset_value) Out-of-Touch Status Clear Register */

#define CATB_OUTTCHCLR_OUTTCHCLR_Pos 0            /**< \brief (CATB_OUTTCHCLR) Out of Touch */
#define CATB_OUTTCHCLR_OUTTCHCLR_Msk (_U(0xFFFFFFFF) << CATB_OUTTCHCLR_OUTTCHCLR_Pos)
#define CATB_OUTTCHCLR_OUTTCHCLR(value) (CATB_OUTTCHCLR_OUTTCHCLR_Msk & ((value) << CATB_OUTTCHCLR_OUTTCHCLR_Pos))
#define CATB_OUTTCHCLR_MASK         _U(0xFFFFFFFF) /**< \brief (CATB_OUTTCHCLR) MASK Register */

/* -------- CATB_PARAMETER : (CATB Offset: 0xF8) (R/  32) Parameter Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t NPINS:8;          /*!< bit:  0.. 7  Number of Pins                     */
    uint32_t NSTATUS:8;        /*!< bit:  8..15  Number of Status bits              */
    uint32_t FRACTIONAL:4;     /*!< bit: 16..19  Number of Fractional bits          */
    uint32_t :12;              /*!< bit: 20..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} CATB_PARAMETER_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

