frankleonrose/framework-cmsis-atmelsam/variants/atmelsam/sam4l8/include/component/catb.h
#define CATB_PARAMETER_OFFSET       0xF8         /**< \brief (CATB_PARAMETER offset) Parameter Register */

#define CATB_PARAMETER_NPINS_Pos    0            /**< \brief (CATB_PARAMETER) Number of Pins */
#define CATB_PARAMETER_NPINS_Msk    (_U(0xFF) << CATB_PARAMETER_NPINS_Pos)
#define CATB_PARAMETER_NPINS(value) (CATB_PARAMETER_NPINS_Msk & ((value) << CATB_PARAMETER_NPINS_Pos))
#define CATB_PARAMETER_NSTATUS_Pos  8            /**< \brief (CATB_PARAMETER) Number of Status bits */
#define CATB_PARAMETER_NSTATUS_Msk  (_U(0xFF) << CATB_PARAMETER_NSTATUS_Pos)
#define CATB_PARAMETER_NSTATUS(value) (CATB_PARAMETER_NSTATUS_Msk & ((value) << CATB_PARAMETER_NSTATUS_Pos))
#define CATB_PARAMETER_FRACTIONAL_Pos 16           /**< \brief (CATB_PARAMETER) Number of Fractional bits */
#define CATB_PARAMETER_FRACTIONAL_Msk (_U(0xF) << CATB_PARAMETER_FRACTIONAL_Pos)
#define CATB_PARAMETER_FRACTIONAL(value) (CATB_PARAMETER_FRACTIONAL_Msk & ((value) << CATB_PARAMETER_FRACTIONAL_Pos))
#define CATB_PARAMETER_MASK         _U(0x000FFFFF) /**< \brief (CATB_PARAMETER) MASK Register */

/* -------- CATB_VERSION : (CATB Offset: 0xFC) (R/  32) Version Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t VERSION:12;       /*!< bit:  0..11  Version number                     */
    uint32_t :4;               /*!< bit: 12..15  Reserved                           */
    uint32_t VARIANT:4;        /*!< bit: 16..19  Variant number                     */
    uint32_t :12;              /*!< bit: 20..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} CATB_VERSION_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define CATB_VERSION_OFFSET         0xFC         /**< \brief (CATB_VERSION offset) Version Register */
#define CATB_VERSION_RESETVALUE     _U(0x00000100); /**< \brief (CATB_VERSION reset_value) Version Register */

#define CATB_VERSION_VERSION_Pos    0            /**< \brief (CATB_VERSION) Version number */
#define CATB_VERSION_VERSION_Msk    (_U(0xFFF) << CATB_VERSION_VERSION_Pos)
#define CATB_VERSION_VERSION(value) (CATB_VERSION_VERSION_Msk & ((value) << CATB_VERSION_VERSION_Pos))
#define CATB_VERSION_VARIANT_Pos    16           /**< \brief (CATB_VERSION) Variant number */
#define CATB_VERSION_VARIANT_Msk    (_U(0xF) << CATB_VERSION_VARIANT_Pos)
#define CATB_VERSION_VARIANT(value) (CATB_VERSION_VARIANT_Msk & ((value) << CATB_VERSION_VARIANT_Pos))
#define CATB_VERSION_MASK           _U(0x000F0FFF) /**< \brief (CATB_VERSION) MASK Register */

/** \brief CatbIntch hardware registers */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
 struct {
  __I  CATB_INTCH_Type           INTCH;       /**< \brief Offset: 0x00 (R/  32) In-Touch Status Register */
 } bf;
 struct {
  RoReg   CATB_INTCH;         /**< \brief (CATB Offset: 0x00) In-Touch Status Register */
 } reg;
} CatbIntch;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

/** \brief CatbIntchclr hardware registers */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
 struct {
  __O  CATB_INTCHCLR_Type        INTCHCLR;    /**< \brief Offset: 0x00 ( /W 32) In-Touch Status Clear Register */
 } bf;
 struct {
  WoReg   CATB_INTCHCLR;      /**< \brief (CATB Offset: 0x00) In-Touch Status Clear Register */
 } reg;
} CatbIntchclr;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

/** \brief CatbOuttch hardware registers */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
 struct {
  __I  CATB_OUTTCH_Type          OUTTCH;      /**< \brief Offset: 0x00 (R/  32) Out-of-Touch Status Register */
 } bf;
 struct {
  RoReg   CATB_OUTTCH;        /**< \brief (CATB Offset: 0x00) Out-of-Touch Status Register */
 } reg;
} CatbOuttch;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

/** \brief CatbOuttchclr hardware registers */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
 struct {
  __O  CATB_OUTTCHCLR_Type       OUTTCHCLR;   /**< \brief Offset: 0x00 ( /W 32) Out-of-Touch Status Clear Register */
 } bf;
 struct {
  WoReg   CATB_OUTTCHCLR;     /**< \brief (CATB Offset: 0x00) Out-of-Touch Status Clear Register */
 } reg;
} CatbOuttchclr;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

/** \brief CATB hardware registers */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
 struct {
  __IO CATB_CR_Type              CR;          /**< \brief Offset: 0x00 (R/W 32) Control Register */
  __IO CATB_CNTCR_Type           CNTCR;       /**< \brief Offset: 0x04 (R/W 32) Counter Control Register */
  __IO CATB_IDLE_Type            IDLE;        /**< \brief Offset: 0x08 (R/W 32) Sensor Idle Level */
  __I  CATB_LEVEL_Type           LEVEL;       /**< \brief Offset: 0x0C (R/  32) Sensor Relative Level */
  __I  CATB_RAW_Type             RAW;         /**< \brief Offset: 0x10 (R/  32) Sensor Raw Value */
  __IO CATB_TIMING_Type          TIMING;      /**< \brief Offset: 0x14 (R/W 32) Filter Timing Register */
  __IO CATB_THRESH_Type          THRESH;      /**< \brief Offset: 0x18 (R/W 32) Threshold Register */
  __IO CATB_PINSEL_Type          PINSEL;      /**< \brief Offset: 0x1C (R/W 32) Pin Selection Register */
  __IO CATB_DMA_Type             DMA;         /**< \brief Offset: 0x20 (R/W 32) Direct Memory Access Register */
  __I  CATB_ISR_Type             ISR;         /**< \brief Offset: 0x24 (R/  32) Interrupt Status Register */
  __O  CATB_IER_Type             IER;         /**< \brief Offset: 0x28 ( /W 32) Interrupt Enable Register */
  __O  CATB_IDR_Type             IDR;         /**< \brief Offset: 0x2C ( /W 32) Interrupt Disable Register */
  __I  CATB_IMR_Type             IMR;         /**< \brief Offset: 0x30 (R/  32) Interrupt Mask Register */
  __O  CATB_SCR_Type             SCR;         /**< \brief Offset: 0x34 ( /W 32) Status Clear Register */
       RoReg8                    Reserved1[0x8];
       CatbIntch                 Intch[1];    /**< \brief Offset: 0x40 CatbIntch groups [STATUS_REG_NUMBER] */
       RoReg8                    Reserved2[0xC];
       CatbIntchclr              Intchclr[1]; /**< \brief Offset: 0x50 CatbIntchclr groups [STATUS_REG_NUMBER] */
       RoReg8                    Reserved3[0xC];
       CatbOuttch                Outtch[1];   /**< \brief Offset: 0x60 CatbOuttch groups [STATUS_REG_NUMBER] */
       RoReg8                    Reserved4[0xC];
       CatbOuttchclr             Outtchclr[1]; /**< \brief Offset: 0x70 CatbOuttchclr groups [STATUS_REG_NUMBER] */
       RoReg8                    Reserved5[0x84];
  __I  CATB_PARAMETER_Type       PARAMETER;   /**< \brief Offset: 0xF8 (R/  32) Parameter Register */
  __I  CATB_VERSION_Type         VERSION;     /**< \brief Offset: 0xFC (R/  32) Version Register */
 } bf;
 struct {
  RwReg   CATB_CR;            /**< \brief (CATB Offset: 0x00) Control Register */
  RwReg   CATB_CNTCR;         /**< \brief (CATB Offset: 0x04) Counter Control Register */
  RwReg   CATB_IDLE;          /**< \brief (CATB Offset: 0x08) Sensor Idle Level */
  RoReg   CATB_LEVEL;         /**< \brief (CATB Offset: 0x0C) Sensor Relative Level */
  RoReg   CATB_RAW;           /**< \brief (CATB Offset: 0x10) Sensor Raw Value */
  RwReg   CATB_TIMING;        /**< \brief (CATB Offset: 0x14) Filter Timing Register */
  RwReg   CATB_THRESH;        /**< \brief (CATB Offset: 0x18) Threshold Register */
  RwReg   CATB_PINSEL;        /**< \brief (CATB Offset: 0x1C) Pin Selection Register */
  RwReg   CATB_DMA;           /**< \brief (CATB Offset: 0x20) Direct Memory Access Register */
  RoReg   CATB_ISR;           /**< \brief (CATB Offset: 0x24) Interrupt Status Register */
  WoReg   CATB_IER;           /**< \brief (CATB Offset: 0x28) Interrupt Enable Register */
  WoReg   CATB_IDR;           /**< \brief (CATB Offset: 0x2C) Interrupt Disable Register */
  RoReg   CATB_IMR;           /**< \brief (CATB Offset: 0x30) Interrupt Mask Register */
  WoReg   CATB_SCR;           /**< \brief (CATB Offset: 0x34) Status Clear Register */
  RoReg8  Reserved6[0x8];
  CatbIntch CATB_INTCH[1];      /**< \brief (CATB Offset: 0x40) CatbIntch groups [STATUS_REG_NUMBER] */
  RoReg8  Reserved7[0xC];
  CatbIntchclr CATB_INTCHCLR[1];   /**< \brief (CATB Offset: 0x50) CatbIntchclr groups [STATUS_REG_NUMBER] */
  RoReg8  Reserved8[0xC];
  CatbOuttch CATB_OUTTCH[1];     /**< \brief (CATB Offset: 0x60) CatbOuttch groups [STATUS_REG_NUMBER] */
  RoReg8  Reserved9[0xC];
  CatbOuttchclr CATB_OUTTCHCLR[1];  /**< \brief (CATB Offset: 0x70) CatbOuttchclr groups [STATUS_REG_NUMBER] */
  RoReg8  Reserved10[0x84];
  RoReg   CATB_PARAMETER;     /**< \brief (CATB Offset: 0xF8) Parameter Register */
  RoReg   CATB_VERSION;       /**< \brief (CATB Offset: 0xFC) Version Register */
 } reg;
} Catb;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

/*@}*/

#endif /* _SAM4L_CATB_COMPONENT_ */
